wifi_op/trunk/basic/controllers/ArticleController.php

    public function actionIndex()
    {
        $query = Article::find();
        $pagination = new Pagination([
            'defaultPageSize' => 4,
            'totalCount' => $query->count(),
        ]);
        $Article = $query->orderBy('Title')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();
---
SELECT COUNT(*) FROM `article`
SELECT * FROM `article` ORDER BY `Title` LIMIT 4