wifi_op/trunk/basic/controllers/FindcontentController.php

    protected function findModel($id)
    {
        if (($model = FindContent::findOne($id)) !== null) {
---
SELECT * FROM `find_content` WHERE `id`='44'