wifi_op/branches/basic-feature-prizeResultPlus/controllers/AwardController.php

    public function actionCreate()
    {
        $model = new Award();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `award` (`mobile`, `award_type`, `award_type_en`, `award_type_id`, `award_type_zh`) VALUES ('13698523695', 6, '6', '6', '6')

    protected function findModel($id)
    {
        if (($model = Award::findOne($id)) !== null) {
---
SELECT * FROM `award` WHERE `id`='2'