wifi_op/trunk/basic/models/IntegralCategory.php

SELECT * FROM `integral_category`
---
    public static function getCatecory(){
        $return  =array('0'=>'请选择');
        foreach(self::find()->asArray()->all() as $v){

SELECT * FROM `integral_category` WHERE id = 5
---
    public static function getCatNameById($cat_id) {
        $cat = self::find()->where("id = {$cat_id}")->one();