wifi_op/trunk/basic/models/Integralrecord.php

    public static  function getExchangCountByIntegralId($integral_id){
        return self::find()->where("integral_id = {$integral_id} ")->count();
---
SELECT COUNT(*) FROM `integral_record` WHERE integral_id = 16