wifi_op/trunk/basic/models/Integral.php

SELECT * FROM `integral` WHERE `id` = '1'
---
    public static function geTitleById($id,$title="zh"){
        if(!$id){
            return null;
        }
        $model =  self::find()->andFilterWhere(['=','id',$id])->one();