wifi_op/trunk/basic/models/User.php

    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['accessToken' => $token]);
---
SELECT * FROM `user` WHERE `id`=11

    public static function getUsernameByUserId($userId) {
        if($userId==null){
            return null;
        }
        if($user = self::find()->where(['=','id',$userId])->one()){
---
SELECT * FROM `user` WHERE `id` = 11