wifi_op/branches/basic-feature-prizeResultPlus/views/award/_form.php

SELECT * FROM `award`
---
/* @var $this yii\web\View */
/* @var $model app\models\Award */
/* @var $form yii\widgets\ActiveForm */
$row=Award::find()->all();